Repository: Chuweii/Shared-Schedule
Catalog: App/Resources/Localizations/Localizable.xcstrings
Source language: zh_hant
Languages: en, ja

source: %@ 失效
en: Expires %@
ja: 有効期限 %@

source: %lld 分鐘
en: %lld min
ja: %lld 分

# forgotPasswordLink
source: 忘記密碼？
en: Forgot password?
ja: パスワードをお忘れですか？

# inviteSheetGenerateFailed
source: 產生邀請碼失敗，請稍後再試
en: Failed to generate invitation. Please try again.
ja: 招待コードの生成に失敗しました。後でもう一度お試しください。

# inviteSheetLoadError
source: 讀取邀請碼失敗，請稍後再試
en: Failed to load invitations. Please try again.
ja: 招待コードの読み込みに失敗しました。後でもう一度お試しください。

# languageOptionSystem
source: 跟隨系統
en: Follow System
ja: システムに従う

# loginButtonResendAndVerify
source: 重寄驗證碼並前往驗證
en: Resend code & verify
ja: コードを再送信して認証する

# loginButtonSignIn
source: 登入
en: Sign In
ja: ログイン

# loginButtonSignUp
source: 註冊
en: Sign Up
ja: 登録

# loginEmailPlaceholder
source: 電子郵件
en: Email
ja: メールアドレス

# loginErrorEmailNotConfirmed
source: Email 尚未驗證，請輸入驗證碼完成註冊
en: Email not verified yet — enter the code we emailed you
ja: メールアドレスが未認証です。認証コードを入力してください

# loginErrorEmptyEmail
source: 請輸入電子郵件
en: Please enter your email
ja: メールアドレスを入力してください

# loginErrorGeneric
source: 發生錯誤，請稍後再試
en: Something went wrong. Please try again
ja: エラーが発生しました。しばらくしてからもう一度お試しください

# loginErrorInvalidCredentials
source: 電子郵件或密碼錯誤
en: Invalid email or password
ja: メールアドレスまたはパスワードが正しくありません

# loginErrorNetwork
source: 網路連線失敗，請檢查網路
en: Network error. Please check your connection
ja: ネットワーク接続に失敗しました

# loginErrorShortPassword
source: 密碼至少需要 6 個字元
en: Password must be at least 6 characters
ja: パスワードは6文字以上必要です

# loginErrorUserExists
source: 此電子郵件已被註冊
en: This email is already registered
ja: このメールアドレスは既に登録されています

# loginErrorWeakPassword
source: 密碼強度不足
en: Password is too weak
ja: パスワードが脆弱です

# loginPasswordPlaceholder
source: 密碼
en: Password
ja: パスワード

# loginSubtitleSignIn
source: 登入以管理你的課表
en: Sign in to manage your schedule
ja: スケジュールを管理するにはログインしてください

# loginSubtitleSignUp
source: 建立帳號開始使用
en: Create an account to get started
ja: アカウントを作成して始めましょう

# loginSwitchToSignIn
source: 已有帳號？登入
en: Already have an account? Sign in
ja: アカウントをお持ちですか？ログイン

# loginSwitchToSignUp
source: 還沒有帳號？註冊
en: Don't have an account? Sign up
ja: アカウントをお持ちでないですか？登録

# redeemAlreadyMember
source: 你已加入過此課表
en: You have already joined this schedule
ja: このコースには既に参加しています

# redeemExpired
source: 邀請碼已過期
en: This invitation code has expired
ja: 招待コードの有効期限が切れています

# redeemInvalidToken
source: 邀請碼不存在
en: Invitation code not found
ja: 招待コードが見つかりません

# redeemPersistenceFailure
source: 加入失敗，請稍後再試
en: Couldn't join. Please try again.
ja: 参加できませんでした。後でもう一度お試しください。

# redeemSelfRedemption
source: 你是這份課表的老師
en: You are the owner of this schedule
ja: あなたはこのコースのオーナーです

# resetButtonCancel
source: 取消
en: Cancel
ja: キャンセル

# resetButtonResend
source: 重新發送驗證碼
en: Resend code
ja: コードを再送信

# resetButtonSendCode
source: 寄送驗證碼
en: Send code
ja: コードを送信

# resetButtonUpdatePassword
source: 更新密碼
en: Update password
ja: パスワードを更新

# resetButtonVerify
source: 驗證
en: Verify
ja: 認証する

# resetCodeInstruction
source: 驗證碼已寄出（若信箱存在），請輸入信中 6 碼
en: If the email exists, a code is on its way — enter the 6 digits
ja: メールアドレスが存在する場合、コードを送信しました。6桁を入力してください

# resetEmailInstruction
source: 輸入你的註冊 email，我們會寄送驗證碼
en: Enter your account email and we'll send you a code
ja: 登録メールアドレスを入力すると、認証コードを送信します

# resetErrorEmptyCode
source: 請輸入驗證碼
en: Please enter the verification code
ja: 認証コードを入力してください

# resetErrorEmptyEmail
source: 請輸入 email
en: Please enter your email
ja: メールアドレスを入力してください

# resetErrorInvalidCodeFormat
source: 驗證碼須為 6 位數字
en: The code must be 6 digits
ja: 認証コードは6桁の数字です

# resetErrorInvalidOrExpiredCode
source: 驗證碼錯誤或已過期
en: Incorrect or expired code
ja: コードが正しくないか、期限切れです

# resetErrorRateLimited
source: 操作太頻繁，請稍後再試
en: Too many attempts — please try again later
ja: 操作が多すぎます。しばらくしてからお試しください

# resetErrorSamePassword
source: 新密碼不能與舊密碼相同
en: New password must differ from the old one
ja: 新しいパスワードは以前と同じにできません

# resetErrorShortPassword
source: 密碼至少需要 6 個字元
en: Password must be at least 6 characters
ja: パスワードは6文字以上必要です

# resetErrorWeakPassword
source: 密碼強度不足
en: Password is too weak
ja: パスワードが脆弱です

# resetNewPasswordInstruction
source: 設定新密碼（至少 6 個字元）
en: Set a new password (at least 6 characters)
ja: 新しいパスワードを設定（6文字以上）

# resetNewPasswordPlaceholder
source: 新密碼
en: New password
ja: 新しいパスワード

# resetResendCooldown %lld
source: %lld 秒後可重新發送
en: Resend in %llds
ja: %lld秒後に再送信できます

# resetTitle
source: 重設密碼
en: Reset password
ja: パスワードの再設定

# scheduleListJoinedLoadError
source: 無法載入加入的課表
en: Couldn't load joined schedules
ja: 参加中のスケジュールを読み込めませんでした

# scheduleListLoadError
source: 無法載入課表
en: Failed to load schedules
ja: スケジュールを読み込めませんでした

# settingsAccountSection
source: 帳號
en: Account
ja: アカウント

# settingsAppearanceSection
source: 外觀
en: Appearance
ja: 外観

# settingsDeleteAccount
source: 刪除帳號
en: Delete Account
ja: アカウントを削除

# settingsDeleteAccountConfirmButton
source: 刪除
en: Delete
ja: 削除

# settingsDeleteAccountConfirmMessage
source: 此動作將永久刪除你的帳號與所有課表、預約，無法復原。
en: This will permanently delete your account and all your schedules and bookings. This cannot be undone.
ja: この操作はアカウントとすべてのスケジュール・予約を完全に削除します。元に戻せません。

# settingsDeleteAccountConfirmTitle
source: 刪除帳號
en: Delete Account
ja: アカウントを削除

# settingsDisplayNameLabel
source: 顯示名稱
en: Display Name
ja: 表示名

# settingsDisplayNameSaved
source: 已更新
en: Updated
ja: 更新しました

# settingsErrorDeleteFailed
source: 刪除失敗，請稍後再試
en: Failed to delete. Please try again later
ja: 削除に失敗しました。後でもう一度お試しください

# settingsErrorDisplayNameTooLong
source: 顯示名稱不能超過 50 字
en: Display name cannot exceed 50 characters
ja: 表示名は50文字以内にしてください

# settingsErrorEmptyDisplayName
source: 請輸入顯示名稱
en: Please enter your display name
ja: 表示名を入力してください

# settingsErrorSaveFailed
source: 儲存失敗，請稍後再試
en: Failed to save. Please try again later
ja: 保存に失敗しました。後でもう一度お試しください

# settingsLanguageSection
source: 語言
en: Language
ja: 言語

# settingsSaveDisplayName
source: 儲存
en: Save
ja: 保存

# signUpDisplayNamePlaceholder
source: 顯示名稱
en: Display Name
ja: 表示名

# signUpErrorDisplayNameTooLong
source: 顯示名稱不能超過 50 字
en: Display name cannot exceed 50 characters
ja: 表示名は50文字以内にしてください

# signUpErrorEmptyDisplayName
source: 請輸入顯示名稱
en: Please enter your display name
ja: 表示名を入力してください

# verificationBackToLogin
source: 回到登入
en: Back to sign in
ja: ログインに戻る

# verificationButtonResend
source: 重新發送驗證碼
en: Resend code
ja: コードを再送信

# verificationButtonVerify
source: 驗證
en: Verify
ja: 認証する

# verificationCodePlaceholder
source: 6 位數驗證碼
en: 6-digit code
ja: 6桁のコード

# verificationErrorEmptyCode
source: 請輸入驗證碼
en: Please enter the verification code
ja: 認証コードを入力してください

# verificationErrorInvalidCodeFormat
source: 驗證碼須為 6 位數字
en: The code must be 6 digits
ja: 認証コードは6桁の数字です

# verificationErrorInvalidOrExpiredCode
source: 驗證碼錯誤或已過期
en: Incorrect or expired code
ja: コードが正しくないか、期限切れです

# verificationErrorRateLimited
source: 操作太頻繁，請稍後再試
en: Too many attempts — please try again later
ja: 操作が多すぎます。しばらくしてからお試しください

# verificationResendCooldown %lld
source: %lld 秒後可重新發送
en: Resend in %llds
ja: %lld秒後に再送信できます

# verificationSubtitle
source: 驗證碼已寄到你的信箱
en: We've emailed a 6-digit code to
ja: 6桁の認証コードをメールで送信しました

# verificationTitle
source: 輸入驗證碼
en: Enter verification code
ja: 認証コードを入力

source: 一
en: M
ja: 月

source: 三
en: W
ja: 水

source: 二
en: T
ja: 火

source: 五
en: F
ja: 金

source: 你還不是這個課表的學生
en: You're not enrolled in this schedule yet
ja: このスケジュールにはまだ登録されていません

source: 儲存失敗，請稍後再試
en: Failed to save. Please try again
ja: 保存に失敗しました。しばらくしてからもう一度お試しください

source: 六
en: S
ja: 土

source: 加入
en: Join
ja: 参加する

source: 加入別人的課表
en: Join Someone's Schedule
ja: 他の人のスケジュールに参加

source: 加入課表
en: Join Schedule
ja: コースに参加

source: 取消
en: Cancel
ja: キャンセル

source: 取消預約
en: Cancel booking
ja: 予約をキャンセル

source: 可預約日期
en: Available Days
ja: 予約可能日

source: 可預約時間
en: Available Time
ja: 予約可能時間

source: 四
en: T
ja: 木

source: 完成
en: Done
ja: 完了

source: 已加入「%@」
en: Joined %@
ja: 「%@」に参加しました

source: 已被預約
en: Booked by someone else
ja: 他の人が予約済み

source: 已被預約，請選其他時段
en: Already booked — please pick another slot
ja: 予約済みです。別の時間帯を選んでください

source: 已複製到剪貼簿
en: Copied to clipboard
ja: クリップボードにコピーしました

source: 已預約
en: Booked
ja: 予約済み

source: 建立
en: Create
ja: 作成

source: 建立你的第一份課表，讓學生預約你的時間
en: Create your first schedule so students can book your time
ja: 最初のスケジュールを作成して、生徒があなたの時間を予約できるようにしましょう

source: 建立後可針對每天細調時段
en: You can customize each day's slots after creation
ja: 作成後に各曜日の枠を個別調整できます

source: 建立自己的課表，或輸入邀請碼加入別人的
en: Create your own schedule, or enter an invitation code to join someone else's
ja: 自分のスケジュールを作るか、招待コードを入力して参加しましょう

source: 建立課表
en: Create Schedule
ja: スケジュール作成

source: 我加入的
en: Joined
ja: 参加中

source: 我的課表
en: My Schedules
ja: マイスケジュール

source: 找不到此課表
en: Schedule not found
ja: スケジュールが見つかりません

source: 新增
en: Add
ja: 追加

source: 新增可預約時段，讓學生知道你何時有空
en: Add available time slots so students know when you're free
ja: 予約可能な時間枠を追加して、生徒にあなたの空き時間を知らせましょう

source: 新增時段
en: Add Time Slot
ja: スロット追加

source: 新增課表
en: New Schedule
ja: 新規スケジュール

source: 日
en: S

source: 時段與既有時段重疊
en: This time slot overlaps with an existing one
ja: 既存のスロットと重複しています

source: 時段長度不得短於最短時段設定
en: Slot duration must meet the minimum requirement
ja: スロットの長さが最短設定を下回っています

source: 最短時段長度
en: Minimum Slot Duration
ja: 最短スロット時間

source: 標題不能為空
en: Title cannot be empty
ja: タイトルは空にできません

source: 每堂最短 %lld 分鐘
en: Min. %lld min per slot
ja: 1枠最短 %lld 分

source: 無權限修改此課表
en: You don't have permission to edit this schedule
ja: このスケジュールを編集する権限がありません

source: 產生一個邀請碼分享給學生，他們可以用這組碼加入這份課表
en: Generate an invitation code to share with students. They can use it to join this schedule.
ja: 招待コードを生成して生徒と共有しましょう。コードを使ってこのスケジュールに参加できます。

source: 產生新邀請碼
en: Generate New Code
ja: 新しいコードを生成

source: 當天沒有可預約時段
en: No available slots for this day
ja: この日の予約可能なスロットはありません

source: 登出
en: Sign Out
ja: ログアウト

source: 確定取消這筆預約？
en: Cancel this booking?
ja: この予約をキャンセルしますか？

source: 確定預約 %@–%@？
en: Book %@–%@?
ja: %@–%@を予約しますか？

source: 確定預約？
en: Book this slot?
ja: 予約しますか？

source: 結束
en: End
ja: 終了

source: 結束時間
en: End Time
ja: 終了時刻

source: 結束時間必須晚於開始時間
en: End time must be after start time
ja: 終了時刻は開始時刻より後でなければなりません

source: 老師不能預約自己的課表
en: Teachers cannot book their own schedule
ja: 講師は自分のスケジュールを予約できません

source: 複製
en: Copy
ja: コピー

source: 規則時段不得短於最短時段設定
en: The rule's time range cannot be shorter than the minimum slot duration
ja: ルールの時間帯は最短時間の設定より短くできません

source: 設定
en: Settings

source: 該日已有可預約規則
en: This day already has an availability rule
ja: この曜日にはすでに予約可能ルールがあります

source: 課表
en: Schedules
ja: スケジュール

source: 請至少選擇一天可預約日期
en: Please select at least one available day
ja: 予約可能日を少なくとも1日選択してください

source: 輸入課表名稱
en: Enter schedule name
ja: スケジュール名を入力

source: 輸入邀請碼
en: Enter Invitation Code
ja: 招待コードを入力

source: 這個時段不在課表內
en: This slot is not in the schedule
ja: この時間帯はスケジュール内にありません

source: 這個時段已過
en: This slot is in the past
ja: この時間帯は過去のものです

source: 這個時段已開始，無法取消
en: This slot has started and cannot be cancelled
ja: この時間帯は既に開始しているためキャンセルできません

source: 邀請學生
en: Invite Students
ja: 生徒を招待

source: 邀請學生加入「%@」
en: Invite students to join %@
ja: 生徒を「%@」に招待

source: 邀請碼
en: Invitation code
ja: 招待コード

source: 邀請碼共 8 個英數字元
en: Invitation codes are 8 alphanumeric characters
ja: 招待コードは英数字8文字です

source: 還沒有時段
en: No Time Slots Yet
ja: タイムスロットがありません

source: 還沒有課表
en: No Schedules Yet
ja: スケジュールがありません

source: 還沒有邀請碼
en: No invitation codes yet
ja: 招待コードがまだありません

source: 重試
en: Retry
ja: 再試行

source: 開始
en: Start

source: 開始時間
en: Start Time
ja: 開始時刻

source: 預約失敗，請稍後再試
en: Booking failed, please try again
ja: 予約に失敗しました。後でもう一度お試しください

source: 預約這個時段
en: Book this slot
ja: この時間帯を予約
